# pandas：数据分析处理库

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/titanic.csv')

In [5]:
#读取前几条数据,指定前几条
df.head(3)

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male

In [6]:
#返回当前的信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
row.names    1313 non-null int64
pclass       1313 non-null object
survived     1313 non-null int64
name         1313 non-null object
age          633 non-null float64
embarked     821 non-null object
home.dest    754 non-null object
room         77 non-null object
ticket       69 non-null object
boat         347 non-null object
sex          1313 non-null object
dtypes: float64(1), int64(2), object(8)
memory usage: 112.9+ KB

In [8]:
#查看索引
df.index

RangeIndex(start=0, stop=1313, step=1)

In [10]:
df.columns

Index(['row.names', 'pclass', 'survived', 'name', 'age', 'embarked',
       'home.dest', 'room', 'ticket', 'boat', 'sex'],
      dtype='object')

In [12]:
df.dtypes

row.names      int64
pclass        object
survived       int64
name          object
age          float64
embarked      object
home.dest     object
room          object
ticket        object
boat          object
sex           object
dtype: object

In [13]:
df.values

array([[1, '1st', 1, ..., '24160 L221', '2', 'female'],
       [2, '1st', 0, ..., nan, nan, 'female'],
       [3, '1st', 0, ..., nan, '(135)', 'male'],
       ...,
       [1311, '3rd', 0, ..., nan, nan, 'male'],
       [1312, '3rd', 0, ..., nan, nan, 'female'],
       [1313, '3rd', 0, ..., nan, nan, 'male']], dtype=object)

In [14]:
#自己创建一个DataFrame结构
data = {
    'country': ['aaa', 'bbb', 'ccc'],
    'population':[10, 12, 14]
}
df_data = pd.DataFrame(data)
df_data

  country  population
0     aaa          10
1     bbb          12
2     ccc          14

In [15]:
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
country       3 non-null object
population    3 non-null int64
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

##### 取指定的数据

In [18]:
age = df['age']
age[:5]

0    29.0000
1     2.0000
2    30.0000
3    25.0000
4     0.9167
Name: age, dtype: float64

series:dataframe中的一行、列

In [19]:
age.index

RangeIndex(start=0, stop=1313, step=1)

In [20]:
age.values[:5]

array([29.    ,  2.    , 30.    , 25.    ,  0.9167])

In [21]:
df.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

##### 指定索引

In [22]:
df = df.set_index('name')
df.head()

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allen, Miss Elisabeth Walton",1,1st,1,29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
"Allison, Miss Helen Loraine",2,1st,0,2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Mr Hudson Joshua Creighton",3,1st,0,30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Master Hudson Trevor",5,1st,1,0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [23]:
df['age'][:5]

name
Allen, Miss Elisabeth Walton                       29.0000
Allison, Miss Helen Loraine                         2.0000
Allison, Mr Hudson Joshua Creighton                30.0000
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)    25.0000
Allison, Master Hudson Trevor                       0.9167
Name: age, dtype: float64

In [24]:
age = df['age']
age['Allen, Miss Elisabeth Walton']

29.0

In [26]:
age = age + 10
age[:5]

name
Allen, Miss Elisabeth Walton                       49.0000
Allison, Miss Helen Loraine                        22.0000
Allison, Mr Hudson Joshua Creighton                50.0000
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)    45.0000
Allison, Master Hudson Trevor                      20.9167
Name: age, dtype: float64

In [27]:
age.mean() #均值

51.19418104265402

In [28]:
age.max()

91.0

In [29]:
age.min()

20.1667

In [30]:
#统计
df.describe()

         row.names     survived         age
count  1313.000000  1313.000000  633.000000
mean    657.000000     0.341965   31.194181
std     379.174762     0.474549   14.747525
min       1.000000     0.000000    0.166700
25%     329.000000     0.000000   21.000000
50%     657.000000     0.000000   30.000000
75%     985.000000     1.000000   41.000000
max    1313.000000     1.000000   71.000000

## pandas索引

In [34]:
df = pd.read_csv('./data/titanic.csv')
df['age'][:5]

0    29.0000
1     2.0000
2    30.0000
3    25.0000
4     0.9167
Name: age, dtype: float64

In [36]:
df[['age', 'pclass']][:5]

       age pclass
0  29.0000    1st
1   2.0000    1st
2  30.0000    1st
3  25.0000    1st
4   0.9167    1st

loc 用label定位<br/>
iloc 用position定位

In [37]:
#拿到其中一个数据
df.iloc[0]

row.names                               1
pclass                                1st
survived                                1
name         Allen, Miss Elisabeth Walton
age                                    29
embarked                      Southampton
home.dest                    St Louis, MO
room                                  B-5
ticket                         24160 L221
boat                                    2
sex                                female
Name: 0, dtype: object

In [38]:
df.iloc[0:5]

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [39]:
#要其中部分列
df.iloc[0:5, 1:3]

  pclass  survived
0    1st         1
1    1st         0
2    1st         0
3    1st         0
4    1st         1

In [40]:
df = df.set_index('name')

In [41]:
df.loc['Allison, Mr Hudson Joshua Creighton']

row.names                                  3
pclass                                   1st
survived                                   0
age                                       30
embarked                         Southampton
home.dest    Montreal, PQ / Chesterville, ON
room                                     C26
ticket                                   NaN
boat                                   (135)
sex                                     male
Name: Allison, Mr Hudson Joshua Creighton, dtype: object

In [42]:
#qu'chu
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass']

'1st'

In [44]:
#这样切片也可以
df.loc['Allison, Mr Hudson Joshua Creighton':'Allison, Master Hudson Trevor']

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allison, Mr Hudson Joshua Creighton",3,1st,0,30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Allison, Master Hudson Trevor",5,1st,1,0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [45]:
#赋值操作
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass'] = '2nd'

In [46]:
df.loc['Allison, Mr Hudson Joshua Creighton', 'pclass']

'2nd'

### bool类型索引

In [47]:
df['age'] > 20

name
Allen, Miss Elisabeth Walton                         True
Allison, Miss Helen Loraine                         False
Allison, Mr Hudson Joshua Creighton                  True
Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)      True
Allison, Master Hudson Trevor                       False
Anderson, Mr Harry                                   True
Andrews, Miss Kornelia Theodosia                     True
Andrews, Mr Thomas, jr                               True
Appleton, Mrs Edward Dale (Charlotte Lamson)         True
Artagaveytia, Mr Ramon                               True
Astor, Colonel John Jacob                            True
Astor, Mrs John Jacob (Madeleine Talmadge Force)    False
Aubert, Mrs Leontine Pauline                        False
Barkworth, Mr Algernon H.                           False
Baumann, Mr John D.                                 False
Baxter, Mrs James (Helene DeLaudeniere Chaput)       True
Baxter, Mr Quigg Edmond                              True
Beattie, Mr Thomson                                  True
Beckwith, Mr Richard Leonard                         True
Beckwith, Mrs Richard Leonard (Sallie Monypeny)      True
Behr, Mr Karl Howell                                 True
Birnbaum, Mr Jakob                                   True
Bishop, Mr Dickinson H.                              True
Bishop, Mrs Dickinson H. (Helen Walton)             False
Bjornstrm-Steffansson, Mr Mauritz Hakan              True
Blackwell, Mr Stephen Weart                          True
Blank, Mr Henry                                      True
Bonnell, Miss Caroline                               True
Bonnell, Miss Elizabeth                              True
Borebank, Mr John James                             False
                                                    ...
Vestrom, Miss Hulda Amanda Adolfina                 False
Vonk, Mr Jenko                                      False
Ware, Mr Frederick                                  False
Warren, Mr Charles William                          False
Wazli, Mr Yousif                                    False
Webber, Mr James                                    False
Wennerstrom, Mr August Edvard                       False
Wenzel, Mr Linhart                                  False
Widegren, Mr Charles Peter                          False
Wiklund, Mr Jacob Alfred                            False
Wilkes, Mrs Ellen                                   False
Willer, Mr Aaron                                    False
Willey, Mr Edward                                   False
Williams, Mr Howard Hugh                            False
Williams, Mr Leslie                                 False
Windelov, Mr Einar                                  False
Wirz, Mr Albert                                     False
Wiseman, Mr Phillippe                               False
Wittevrongel, Mr Camiel                             False
Yalsevac, Mr Ivan                                   False
Yasbeck, Mr Antoni                                  False
Yasbeck, Mrs Antoni                                 False
Youssef, Mr Gerios                                  False
Zabour, Miss Hileni                                 False
Zabour, Miss Tamini                                 False
Zakarian, Mr Artun                                  False
Zakarian, Mr Maprieder                              False
Zenn, Mr Philip                                     False
Zievens, Rene                                       False
Zimmerman, Leo                                      False
Name: age, Length: 1313, dtype: bool

In [49]:
df[df['age'] > 20][:5]

,row.names,pclass,survived,age,embarked,home.dest,room,ticket,boat,sex
name,,,,,,,,,,
"Allen, Miss Elisabeth Walton",1,1st,1,29.0,Southampton,"St Louis, MO",B-5,24160 L221,2,female
"Allison, Mr Hudson Joshua Creighton",3,2nd,0,30.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",4,1st,0,25.0,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
"Anderson, Mr Harry",6,1st,1,47.0,Southampton,"New York, NY",E-12,NaN,3,male
"Andrews, Miss Kornelia Theodosia",7,1st,1,63.0,Southampton,"Hudson, NY",D-7,13502 L77,10,female

In [51]:
#对所有男性的年龄求平均值
df.loc[df['sex'] == 'male', 'age'].mean()

31.58141

In [52]:
#统计年龄大于70的人数
(df['age'] > 70).sum()

3

### groupby

In [53]:
df = pd.DataFrame({
    'key':['A','B','C','A','B','C','A','B','C'],
    'data':[0,5,10,5,10,15,10,15,20]
})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [54]:
for key in ['A', 'B', 'C']:
    print(key, ":")
    print(df[df['key'] == key].sum())

A :
key     AAA
data     15
dtype: object
B :
key     BBB
data     30
dtype: object
C :
key     CCC
data     45
dtype: object

In [58]:
df.groupby('key').mean()

     data
key
A       5
B      10
C      15

In [59]:
#groupby可以结合numpy来使用
import numpy as np
df.groupby('key').aggregate(np.mean)

     data
key
A       5
B      10
C      15

In [61]:
df = pd.read_csv('./data/titanic.csv')

In [62]:
df.groupby('sex')['age'].mean()

sex
female    30.572702
male      31.581410
Name: age, dtype: float64

In [63]:
df.groupby('sex')['survived'].mean()

sex
female    0.663067
male      0.167059
Name: survived, dtype: float64

## 数值计算

In [64]:
df = pd.DataFrame(
    [
    [1,2,3],
    [4,5,6]
    ], 
    index = ['a','b'], columns=['A','B','C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [66]:
#默认按列求和
df.sum()

A    5
B    7
C    9
dtype: int64

In [67]:
df.sum(axis=1)

a     6
b    15
dtype: int64

In [68]:
df.sum(axis='columns')

a     6
b    15
dtype: int64

In [69]:
df.mean()

A    2.5
B    3.5
C    4.5
dtype: float64

In [70]:
df.min()
df.max()
df.median()

A    2.5
B    3.5
C    4.5
dtype: float64

### 二元统计

In [71]:
df = pd.read_csv('./data/titanic.csv')
df.head()

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [72]:
#特征之间的协方差
df.cov()

               row.names   survived          age
row.names  143773.500000 -64.001524 -1404.024271
survived      -64.001524   0.225196    -0.586996
age         -1404.024271  -0.586996   217.489502

In [73]:
#相关系数
df.corr()

           row.names  survived       age
row.names   1.000000 -0.355689 -0.389162
survived   -0.355689  1.000000 -0.080048
age        -0.389162 -0.080048  1.000000

In [76]:
#不同年龄的人的个数
df['age'].value_counts()

30.0000    28
18.0000    25
36.0000    23
22.0000    23
24.0000    22
21.0000    21
19.0000    21
23.0000    20
26.0000    20
28.0000    19
25.0000    18
32.0000    18
20.0000    17
45.0000    17
27.0000    16
35.0000    14
40.0000    13
31.0000    12
33.0000    12
34.0000    11
50.0000    11
39.0000    11
48.0000    11
38.0000    10
17.0000    10
16.0000    10
29.0000    10
42.0000     9
49.0000     9
46.0000     8
           ..
6.0000      5
60.0000     5
56.0000     4
8.0000      4
1.0000      4
57.0000     4
4.0000      4
13.0000     4
5.0000      3
0.8333      3
71.0000     3
15.0000     3
53.0000     3
14.0000     3
11.0000     3
51.0000     3
59.0000     3
61.0000     3
62.0000     2
63.0000     2
12.0000     2
65.0000     2
69.0000     1
7.0000      1
67.0000     1
70.0000     1
0.9167      1
0.1667      1
10.0000     1
0.3333      1
Name: age, Length: 73, dtype: int64

In [77]:
#按照升序排列
df['age'].value_counts(ascending = True)

0.3333      1
10.0000     1
0.1667      1
0.9167      1
70.0000     1
67.0000     1
7.0000      1
69.0000     1
65.0000     2
12.0000     2
63.0000     2
62.0000     2
61.0000     3
59.0000     3
51.0000     3
11.0000     3
14.0000     3
53.0000     3
15.0000     3
71.0000     3
0.8333      3
5.0000      3
13.0000     4
4.0000      4
57.0000     4
1.0000      4
8.0000      4
56.0000     4
60.0000     5
6.0000      5
           ..
46.0000     8
49.0000     9
42.0000     9
29.0000    10
16.0000    10
17.0000    10
38.0000    10
48.0000    11
39.0000    11
50.0000    11
34.0000    11
33.0000    12
31.0000    12
40.0000    13
35.0000    14
27.0000    16
45.0000    17
20.0000    17
32.0000    18
25.0000    18
28.0000    19
26.0000    20
23.0000    20
19.0000    21
21.0000    21
24.0000    22
22.0000    23
36.0000    23
18.0000    25
30.0000    28
Name: age, Length: 73, dtype: int64

In [78]:
#平均分成n组
df['age'].value_counts(ascending = True, bins = 5)

(56.833, 71.0]       39
(0.0949, 14.333]     59
(42.667, 56.833]    106
(28.5, 42.667]      184
(14.333, 28.5]      245
Name: age, dtype: int64

In [79]:
#统计不为0的样本的个数
print(df['age'].count())
print(df['pclass'].count())

633
1313

## 对象操作